[
  {
    "id": "aula1",
    "titulo": "Aula 1: Apresentação e Lógica",
    "descricao": "Apresentação do plano de ensino, ambientação no Moodle e importância da lógica para programação.",
    "arquivo": "aula1.html",
    "ativo": true
  },
  {
    "id": "aula2",
    "titulo": "Aula 2: Raciocínio Lógico",
    "descricao": "A importância do raciocínio lógico na computação e exemplos do cotidiano.",
    "arquivo": "aula2.html",
    "ativo": true
  },
  {
    "id": "aula3",
    "titulo": "Aula 3: Estruturação de Algoritmos",
    "descricao": "Estruturação do raciocínio em etapas. Algoritmo como sequência ordenada de instruções.",
    "arquivo": "aula3.html",
    "ativo": true
  },
  {
    "id": "aula4",
    "titulo": "Aula 4: Do Pseudocódigo ao C",
    "descricao": "A transição do planeamento em Portugol para a implementação em Linguagem C.",
    "arquivo": "aula4.html",
    "ativo": true
  },
  {
    "id": "aula5",
    "titulo": "Aula 5: Representação Gráfica com Fluxogramas",
    "descricao": "Aprendendo a representar algoritmos visualmente usando fluxogramas e simbologia padrão.",
    "arquivo": "aula5.html",
    "ativo": true
  },
  {
    "id": "aula6",
    "titulo": "Aula 6: Variáveis e Constantes",
    "descricao": "Declaração e uso de variáveis e constantes. Tipos primitivos em C.",
    "arquivo": "aula6.html",
    "ativo": true
  },
  {
    "id": "aula7",
    "titulo": "Aula 7: Operadores e Expressões em C",
    "descricao": "Identificação e uso de operadores aritméticos, relacionais e lógicos em expressões. Ordem de precedência e impacto do agrupamento com parênteses.",
    "arquivo": "aula7.html",
    "ativo": true
  },
  {
    "id": "aula8",
    "titulo": "Aula 8: Leitura Múltipla, Cálculos Encadeados e printf Formatado",
    "descricao": "Construção de programas sequenciais em C utilizando múltiplas leituras com scanf, cálculos encadeados com variáveis intermediárias e formatação de saída profissional com printf.",
    "arquivo": "aula8.html",
    "ativo": true
  },
  {
    "id": "aula9",
    "titulo": "Aula 9: Problemas Sequenciais Aplicados em C",
    "descricao": "Resolução de problemas do cotidiano (salário líquido, IMC, descontos cumulativos) com programas sequenciais em C, integrando leitura com scanf, cálculos encadeados e saída formatada com printf — sem uso de estruturas de seleção ou repetição.",
    "arquivo": "aula9.html",
    "ativo": true
  },
  {
    "id": "aula10",
    "titulo": "Aula 10: Estruturas de Controle Condicional com if e else",
    "descricao": "Introdução prática às estruturas condicionais em C: if, if-else e else if, aplicando operadores relacionais e lógicos para controlar o fluxo do programa e formatar saídas com printf.",
    "arquivo": "aula10.html",
    "ativo": true
  },
  {
    "id": "aula11",
    "titulo": "Aula 11: Estruturas de Controle com switch case",
    "descricao": "Uso da estrutura switch case em C para seleção múltipla, facilitando a escolha de um entre vários caminhos de execução a partir de um único valor.",
    "arquivo": "aula11.html",
    "ativo": true
  },
  {
    "id": "aula12",
    "titulo": "Aula 12: Condições Encadeadas",
    "descricao": "Aprofundando em decisões complexas com a estrutura `if-else if-else` e operadores lógicos.",
    "arquivo": "aula12.html",
    "ativo": true
  }
]
